import numpy as np
data = [0,1,2,3,4,5,6,7,8,9]

x = np.array(data)
x = 2*x

print(x)
print(2*data)

a = np.array( [1,2,3])
b = np.array( [10,20,30] )
print ( 2*a+b)
print (a == 2 )
print (b > 10 )
print ( (a==2) & (b>10))

#행렬
c = np.array( [  [0,1,2], [3,4,5]  ])
print( len(c) )  #행의 수
print(c )

d = np.array( [[[1,2,3,4],
                [5,6,7,8],
                [9,10,11,12]],
              [ [11,12,13,14] ,
                 [15,16,17,18],
                 [19,20,21,22]]]
)

print( d.ndim) # 차원
print(d.shape )

"""
문제03-1)  NumPy를 사용하여 다음과 같은 2차원 행렬을 만들어보세요
10 20 30 40
50 60 70 80
"""

#문제03-1)
data = np.array([ [10, 20, 30, 40] , [50 ,60, 70, 80]])
print (( data + 3) *10)

#문제03-2)
m = np.array([[ 0,  1,  2,  3,  4],
              [ 5,  6,  7,  8,  9],
              [10, 11, 12, 13, 14]])

print( m [ 1,  2])          #7
print( m [ 2,  -1])         #14
print( m [ 1, 1:3])         #[6,7 ]
print( m [ 1:3, 2 ])        #[ 7 12]
print( m [ 0:2, 3:5 ])      #[[3 4]
                            # [8 9]]

#문제03-3)
x = np.array([1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
              11, 12, 13, 14, 15, 16, 17, 18, 19, 20])

print ( x[ x%3==0 ]    )  #[ 3  6  9 12 15 18]
print ( x[ x%4==1 ]    )  #[ 1  5  9 13 17]
print ( x[ (x%3==0) & (x%4==1)]    )

